In [11]:
import pandas as pd
import numpy as np

In [12]:
data = np.random.randn(4,3)

In [13]:
data

array([[-0.55326964, -1.65157071, -1.67657434],
       [-2.35540608,  1.66673069, -0.71074085],
       [-1.09846277, -0.24501709, -0.35914622],
       [ 2.16910746,  0.24624115, -0.57448712]])

In [14]:
dataFrame = pd.DataFrame(data)

In [15]:
dataFrame

          0         1         2
0 -0.553270 -1.651571 -1.676574
1 -2.355406  1.666731 -0.710741
2 -1.098463 -0.245017 -0.359146
3  2.169107  0.246241 -0.574487

In [34]:
newDataFrame = pd.DataFrame(data,index=["A","B","C","D"],columns = ["Salary","Age","Working Hours"])

In [35]:
newDataFrame

     Salary       Age  Working Hours
A -0.553270 -1.651571      -1.676574
B -2.355406  1.666731      -0.710741
C -1.098463 -0.245017      -0.359146
D  2.169107  0.246241      -0.574487

In [38]:
newDataFrame["Age"]

A   -1.651571
B    1.666731
C   -0.245017
D    0.246241
Name: Age, dtype: float64

In [43]:
newDataFrame["Salary"]

A   -0.553270
B   -2.355406
C   -1.098463
D    2.169107
Name: Salary, dtype: float64

In [44]:
newDataFrame.loc["A"]

Salary          -0.553270
Age             -1.651571
Working Hours   -1.676574
Name: A, dtype: float64

In [45]:
## Add new column applend will work and add a new column
newDataFrame["Retirement"] = newDataFrame["Age"] + newDataFrame["Salary"]

In [46]:
newDataFrame

     Salary       Age  Working Hours  Retirement
A -0.553270 -1.651571      -1.676574   -2.204840
B -2.355406  1.666731      -0.710741   -0.688675
C -1.098463 -0.245017      -0.359146   -1.343480
D  2.169107  0.246241      -0.574487    2.415349

In [48]:
# Drop the row
newDataFrame.drop("D")

     Salary       Age  Working Hours  Retirement
A -0.553270 -1.651571      -1.676574   -2.204840
B -2.355406  1.666731      -0.710741   -0.688675
C -1.098463 -0.245017      -0.359146   -1.343480

In [47]:
# Drop column. Need to write axis
newDataFrame.drop("Retirement", axis = 1)

     Salary       Age  Working Hours
A -0.553270 -1.651571      -1.676574
B -2.355406  1.666731      -0.710741
C -1.098463 -0.245017      -0.359146
D  2.169107  0.246241      -0.574487

In [49]:
# To apply the changes
newDataFrame.drop("Retirement", axis = 1, inplace = True) # default inplace is False

In [50]:
newDataFrame

     Salary       Age  Working Hours
A -0.553270 -1.651571      -1.676574
B -2.355406  1.666731      -0.710741
C -1.098463 -0.245017      -0.359146
D  2.169107  0.246241      -0.574487

In [53]:
newDataFrame.loc["A"]["Age"]

-1.6515707065004328

In [54]:
newDataFrame.loc["A","Age"]

-1.6515707065004328

In [55]:
newDataFrame < 0

   Salary    Age  Working Hours
A    True   True           True
B    True  False           True
C    True   True           True
D   False  False           True

In [56]:
booleanFrame = newDataFrame < 0

In [57]:
booleanFrame

   Salary    Age  Working Hours
A    True   True           True
B    True  False           True
C    True   True           True
D   False  False           True

In [58]:
newDataFrame[booleanFrame] # it shows only values < 0

     Salary       Age  Working Hours
A -0.553270 -1.651571      -1.676574
B -2.355406       NaN      -0.710741
C -1.098463 -0.245017      -0.359146
D       NaN       NaN      -0.574487

In [59]:
newDataFrame[newDataFrame > 0] # this is also an anternative option

     Salary       Age  Working Hours
A       NaN       NaN            NaN
B       NaN  1.666731            NaN
C       NaN       NaN            NaN
D  2.169107  0.246241            NaN

In [60]:
newDataFrame[newDataFrame["Age"] > 0]

     Salary       Age  Working Hours
B -2.355406  1.666731      -0.710741
D  2.169107  0.246241      -0.574487

In [61]:
newDataFrame.reset_index() # it resents indexes without inplace it doesn't change the original

  index    Salary       Age  Working Hours
0     A -0.553270 -1.651571      -1.676574
1     B -2.355406  1.666731      -0.710741
2     C -1.098463 -0.245017      -0.359146
3     D  2.169107  0.246241      -0.574487

In [62]:
newIndexList = ["Onur", "Ayse", "Berk", "Ipek"]

In [63]:
newDataFrame["New Index"] = newIndexList

In [64]:
newDataFrame

     Salary       Age  Working Hours New Index
A -0.553270 -1.651571      -1.676574      Onur
B -2.355406  1.666731      -0.710741      Ayse
C -1.098463 -0.245017      -0.359146      Berk
D  2.169107  0.246241      -0.574487      Ipek

In [65]:
newDataFrame.set_index("New Index") # it will pick new index as index, inplace is False by default

             Salary       Age  Working Hours
New Index
Onur      -0.553270 -1.651571      -1.676574
Ayse      -2.355406  1.666731      -0.710741
Berk      -1.098463 -0.245017      -0.359146
Ipek       2.169107  0.246241      -0.574487

In [66]:
newDataFrame.set_index("New Index", inplace=True)

In [69]:
newDataFrame.loc["Onur"]

Salary          -0.553270
Age             -1.651571
Working Hours   -1.676574
Name: Onur, dtype: float64

In [80]:
firstIndex = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]
inIndex = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [81]:
unitedIndex = list(zip(firstIndex,inIndex)) # It unites both list

In [82]:
unitedIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [83]:
unitedIndex = pd.MultiIndex.from_tuples(unitedIndex) # it gives multi-index

In [84]:
unitedIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [85]:
myCartoons = [[40,"A"],[30,"C"],[10,"B"],[9,"D"],[10,"E"],[11,"F"]] # Assign values

In [86]:
cartoonNumpyArray = np.array(myCartoons)

In [87]:
cartoonDataFrame = pd.DataFrame(cartoonNumpyArray,index=unitedIndex,columns=["Age","Job"])

In [88]:
cartoonDataFrame

                   Age Job
Simpson    Homer    40   A
           Bart     30   C
           Marge    10   B
South Park Cartman   9   D
           Kenny    10   E
           Kyle     11   F

In [91]:
cartoonDataFrame.loc["Simpson"].loc["Bart"]

Age    30
Job     C
Name: Bart, dtype: object

In [95]:
cartoonDataFrame.index.names = ["Cartoon", "Name"]

In [96]:
cartoonDataFrame

                   Age Job
Cartoon    Name
Simpson    Homer    40   A
           Bart     30   C
           Marge    10   B
South Park Cartman   9   D
           Kenny    10   E
           Kyle     11   F